"""
Выписав первые шесть простых чисел, получим
2, 3, 5, 7, 11 и 13. Очевидно, что 6-е простое число - 13.

Какое число является 10001-м простым числом? 104743
"""

from time import time
start = time()
import math
#int(math.sqrt(n))+1
prime_list = [2]
#dict = {}
n = 3
lst = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541]
while len(prime_list) < 10001:
    check = True
    f = int(math.sqrt(n))+1
    for i in range(3, f, 2):
        if n % i == 0:
            check = False
            break
    if check:
        prime_list.insert(0, n)
        #dict[n] = f
    n += 2
print(prime_list[::-1])

#print(lst)

#print(dict)

# import math
# #int(math.sqrt(n))+1
# prime_list = [2]
# #dict = {}
# col = 2
# n = 3
# #lst = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541]
# while prime_list[-1] < 10001:
#     check = True
#     f = int(math.sqrt(n))+1
#     for i in range(3, f, 2):
#         if n % i == 0:
#             check = False
#             break
#     if check:
#         prime_list.insert(0, n)
#         col +=n
#         #dict[n] = f
#     n += 2
# #print(prime_list[::-1])
# print(col)
# #print(lst)
# #print(dict)

end = time()
print(end - start)