"""
Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2, первые 10 элементов будут:

1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...

Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.


"""

# [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597, 2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025, 121393, 196418, 317811, 514229, 832040, 1346269, 2178309, 3524578, 5702887]



# fib = [0, 1]
# i = 0
# while fib[i] + fib[i+1] <= 4000000:
#     fib.append(fib[i] + fib[i+1])
#     i+=1
#
# counter = 0
# for el in fib:
#     if el % 2 == 0:
#         counter += el
#
# print(sum(fib), '\n', fib)
# print(counter)


a = 0
b = 1
coll = 0
while (a + b) < 4*10 ** 6:
    b += a
    a = b - a
    if b % 2 == 0:
        coll += b

print(coll)

